JackDoan/PrintRT/cypress/Generated_Source/PSoC4/EndStopStatus.h
/*******************************************************************************
* File Name: EndStopStatus.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_EndStopStatus_H) /* CY_STATUS_REG_EndStopStatus_H */
#define CY_STATUS_REG_EndStopStatus_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} EndStopStatus_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 EndStopStatus_Read(void) ;
void EndStopStatus_InterruptEnable(void) ;
void EndStopStatus_InterruptDisable(void) ;
void EndStopStatus_WriteMask(uint8 mask) ;
uint8 EndStopStatus_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define EndStopStatus_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define EndStopStatus_INPUTS              6


/***************************************
*             Registers
***************************************/

/* Status Register */
#define EndStopStatus_Status             (* (reg8 *) EndStopStatus_sts_intr_sts_reg__STATUS_REG )
#define EndStopStatus_Status_PTR         (  (reg8 *) EndStopStatus_sts_intr_sts_reg__STATUS_REG )
#define EndStopStatus_Status_Mask        (* (reg8 *) EndStopStatus_sts_intr_sts_reg__MASK_REG )
#define EndStopStatus_Status_Aux_Ctrl    (* (reg8 *) EndStopStatus_sts_intr_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_EndStopStatus_H */


/* [] END OF FILE */
